#include <iostream>
using namespace std;
/*
	BOJ 1003 실버3 피보나치 함수

	1. 테이블 정의
		d[n][0] : n을 호출했을 때 0이 출력되는 횟수
		d[n][1] : n을 호출했을 때 1이 출력되는 횟수
        
	2. 점화식 정의
		d[k][0] = d[k-1][0] + d[k-2][0]
		d[k][1] = d[k-1][1] + d[k-2][0]

	3. 초기값
		d[0][0] = 1, d[0][1] = 0
		d[1][0] = 0, d[1][1] = 1
*/

int t, n;
int d[41][2];
int main() {
	cin >> t;
	while (t--) {
		cin >> n;
		d[0][0] = 1, d[0][1] = 0;
		d[1][0] = 0, d[1][1] = 1;
		for (int i = 2; i <= n; i++) {
			d[i][0] = d[i - 1][0] + d[i - 2][0];
			d[i][1] = d[i - 1][1] + d[i - 2][1];
		}
		cout << d[n][0] << ' ' << d[n][1] << '\n';
	}
	return 0;
}